home/programs/emacs/emacs.org
** Help configurations (=cur-config-help.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-help.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-help.el --- help configurations

  ;;; Commentary:

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===which-key===
  (use-package which-key
    :demand t
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.0001))
#+end_src

#+begin_src emacs-lisp
  ;; ===helpful===
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src

#+begin_src emacs-lisp
  ;; ===Info===
  (use-package info
    :config
    (setq meow-info-keymap (make-keymap))
    (meow-define-state info
      "meow state for interacting with Info"
      :lighter "INFO"
      :keymap meow-info-keymap)
    (meow-define-keys 'info
      '(":" . meow-page-up)
      '("?" . meow-page-down)
      '("," . beginning-of-buffer)
      '("." . end-of-buffer)
      ; '("a" . )
      ; '("b" . )
      ; '("c" . Info-follow-reference)
      ; '("d" . )
      ; '("e" . )
      '("f" . Info-menu)
      '("g" . keyboard-quit)
      '("h" . Info-backward-node)
      '("H" . meow-left)
      '("i" . Info-index)
      '("j" . meow-next)
      '("k" . meow-prev)
      '("l" . Info-forward-node)
      '("L" . meow-right)
      '("m" . meow-join)
      '("n" . Info-next)
      ; '("o" . )
      '("p" . Info-prev)
      '("q" . meow-goto-line)
      '("r" . Info-follow-reference)
      ; '("s" . )
      '("t" . Info-toc)
      '("u" . Info-up)
      '("v" . meow-visit)
      ; '("w" . )
      ; '("x" . )
      '("y" . Info-copy-current-node-name)
      '("z" . info-display-manual)
      '("RET" . Info-follow-nearest-node)
      '("SPC" . meow-keypad)
      '("TAB" . Info-next-reference)
      '("<backtab>" . Info-prev-reference)
      '("<escape>" . keyboard-quit))
    (add-hook 'Info-mode-hook #'meow-info-mode))
#+end_src

#+begin_src emacs-lisp
  (provide 'cur-config-help)
  ;;; cur-config-help.el ends here
#+end_src

** Dired configuration (=cur-config-dired.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-dired.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-dired.el --- configurations for dired

  ;;; Commentary:

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===Dired Icons===
  (use-package nerd-icons-dired
    :after (dired)
    :hook (dired-mode . nerd-icons-dired-mode))
#+end_src

#+begin_src emacs-lisp
  ;; ===Dired===
  (use-package dired
    :hook
    (dired-mode . dired-hide-details-mode)
    (dired-mode . hl-line-mode)
    ;; TODO: create a dired-find-file-dwim for external programs
    :bind (:map dired-mode-map
                ;; ===Top Row===
                ;; ("1" . )
                ;; ("!" . )
                ;; ("2" . )
                ;; ("@" . )
                ;; ("3" . )
                ;; ("#" . )
                ;; ("4" . )
                ;; ("$" . )
                ;; ("5" . )
                ;; ("%" . )
                ;; ("6" . )
                ;; ("^" . )
                ;; ("7" . )
                ;; ("&" . )
                ;; ("8" . )
                ;; ("*" . )
                ;; ("9" . )
                ;; ("(" . )
                ;; ("0" . )
                ;; (")" . )

                ;; ===2nd Row===
                ;; ("TAB"  . )
                ;; ("BTAB" . )
                ("q" . kmacro-end-and-call-macro)
                ("Q" . cur/kmacro-toggle)
                ;; ("w" . )
                ;; ("W" . )
                ;; ("e" . )
                ;; ("E" . )
                ("r" . dired-do-rename)
                ("R" . dired-toggle-read-only)
                ("t" . dired-toggle-marks)
                ;; ("T" . )
                ;; ("y" . )
                ;; ("Y" . )
                ("u" . dired-unmark)
                ("U" . dired-unmark-all-marks)
                ("i" . dired-isearch-filenames-regexp)
                ("I" . dired-do-isearch-regexp)
                ;; ("o" . )
                ("O" . dired-do-chown)
                ("p" . dired-previous-line)
                ;; ("P" . )
                ("-" . negative-argument)
                ;; ("_" . )

                ;; ===3rd Row===
                ("<escape>" . keyboard-quit)
                ;; ("a" . )
                ;; ("A" . )
                ;; ("s" . )
                ;; ("S" . )
                ("d" . dired-do-kill-lines)
                ("D" . dired-do-delete)
                ("f" . find-file)
                ;; ("F" . )
                ("g" . revert-buffer)
                ;; ("G" . )
                ("h" . dired-up-directory)
                ;; ("H" . )
                ("j" . dired-next-line)
                ;; ("J" . )
                ("k" . dired-previous-line)
                ;; ("K" . )
                ("l" . dired-find-file)
                ("L" . dired-find-file-other-window)
                ;; (";" . )
                ;; (":" . )
                ("RET" . dired-find-file)
                ;; ("S-RET" . )

                ;; ===4th Row===
                ("z" . dired-undo)
                ;; ("Z" . )
                ("x" . dired-mark)
                ;; ("X" . )
                ("c" . dired-do-copy)
                ("C" . dired-do-copy-regexp)
                ("v" . dired-find-file-other-window)
                ;; ("V" . )
                ;; ("b" . )
                ;; ("B" . )
                ("n" . dired-next-line)
                ;; ("N" . )
                ("m" . dired-mark-files-regexp)
                ("M" . dired-do-chmod)
                ;; ("," . )
                ;; ("<" . )
                ;; ("." . )
                ;; (">" . )
                ("/" . dired-goto-file)
                ;; ("?" . )
                ;; ("'"  . )
                ;; ("\"" . )
                )
    :config
    (setq delete-by-moving-to-trash t)
    (setq dired-recursive-copies t)
    (setq dired-recursive-deletes t)
    (setq dired-listing-switches "-A -G -F -h -l -v --group-directories-first --time-style=long-iso")
    (setq dired-dwim-target t)
    (setq dired-auto-revert-buffer #'dired-directory-changed-p)
    (setq dired-free-space nil)
    (setq dired-make-directory-clickable t)
    (setq dired-mouse-drag-files t))
#+end_src

#+begin_src emacs-lisp
  (provide 'cur-config-dired)
  ;;; cur-config-dired.el ends here
#+end_src

** Faces and theme configurations (=cur-config-faces.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-faces.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-faces.el --- faces configuration

  ;;; Commentary:

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===Default Font===
  (add-to-list 'default-frame-alist
               '(font . "JetBrains Mono Nerd Font-11"))
#+end_src

#+begin_src emacs-lisp
  ;; ===Themes Path===
  (add-to-list 'custom-theme-load-path (locate-user-emacs-file "themes"))

#+end_src

#+begin_src emacs-lisp
  ;; ===Doom Emacs Themes===
  (use-package doom-themes
    :demand t
    :init
    (defun cur/theme-override ()
      "Change faces depending on what the value of `custom-enabled-themes' is."
      (cond ((member 'doom-gruvbox custom-enabled-themes)
             (set-face-attribute 'secondary-selection nil
                                 :background "#504945"))
            ((member 'doom-flatwhite custom-enabled-themes)
             (set-face-attribute 'haskell-operator-face nil
                                 :background (doom-color 'bg)
                                 :foreground (doom-color 'fg))
             (set-face-attribute 'haskell-type-face nil
                                 :background (doom-color 'fw-teal-blend)
                                 :foreground (doom-color 'fw-teal-text))
             (set-face-attribute 'haskell-constructor-face nil
                                 :background (doom-color 'fw-orange-blend)
                                 :foreground (doom-color 'fw-orange-text)))
            (t t)))
    (defun cur/load-theme (theme)
      "Load THEME, disabling all other currently enabled themes. Then
  check for overrides with `cur/theme-override'."
      (interactive
       (list
        (intern (completing-read "Cur Custom Themes: "
                                 (mapcar #'symbol-name
                                         (custom-available-themes))))))
      (condition-case nil
          (progn
            (mapc #'disable-theme custom-enabled-themes)
            (load-theme theme t)
            (cur/theme-override))
        (error "Problem loading theme %s" theme)))
    :bind (:map cur/toggle-map
                ("C-t" . cur/load-theme))
    :config
    (cur/load-theme 'catppuccin))
#+end_src

#+begin_src emacs-lisp
  ;; ===Autothemer===
  (use-package autothemer)
#+end_src

#+begin_src emacs-lisp
  ;; ===Catppuccin Theme===
  (use-package catppuccin-theme
    :after (autothemer))
#+end_src

#+begin_src emacs-lisp
  ;; ===Text Scaling===
  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("k" text-scale-increase "in")
    ("j" text-scale-decrease "out")
    ("f" nil "finished" :exit t)
    ("RET" nil "finished" :exit t))
  (define-key cur/toggle-map (kbd "C-s") 'hydra-text-scale/body)
#+end_src

#+begin_src emacs-lisp
  ;; ===Ef-Themes===
  (use-package ef-themes)
#+end_src

#+begin_src emacs-lisp
  ;; ===Ibuffer Icons===
  (use-package nerd-icons-ibuffer
    :hook (ibuffer-mode . nerd-icons-ibuffer-mode))
#+end_src

#+begin_src emacs-lisp
  (provide 'cur-config-faces)
  ;;; cur-config-faces.el ends here
#+end_src

** Completion system configurations (=cur-config-completion.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-completion.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-completion.el --- configurations emacs completion

  ;;; Commentary:
  ;; This file does not contain code completion.  Rather, this
  ;; is my configuration for Emacs' completion system and
  ;; the main interfaces that use them.  For code completion
  ;; please go see `cur-config-ide.el' and company mode.

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===Counsel==
  (use-package counsel
    :demand t
    :bind (("M-x" . counsel-M-x)
           ("C-x b" . counsel-switch-buffer)
           ("C-x C-f" . counsel-find-file)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history)))
#+end_src

#+begin_src emacs-lisp
  ;; ===Swiper===
  (use-package swiper
    :commands (swiper))
#+end_src

#+begin_src emacs-lisp
  ;; ===Ivy===
  (use-package ivy
    :demand t
    :after (counsel)
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))
#+end_src

#+begin_src emacs-lisp
  (use-package ivy-rich
    :after (counsel ivy)
    :config
    (ivy-rich-mode 1))
#+end_src

#+begin_src emacs-lisp
  (provide 'cur-config-completion)
  ;;; cur-config-completion.el ends here
#+end_src

** Window management configurations (=cur-config-windows.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-windows.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-windows.el --- emacs windows configuration

  ;;; Commentary:

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===Window Functions===
  (defun cur/split-and-follow-horizontally ()
    (interactive)
    (split-window-below)
    (balance-windows)
    (other-window 1))

  (defun cur/split-and-follow-vertically ()
    (interactive)
    (split-window-right)
    (balance-windows)
    (other-window 1))

  (defun cur/other-window-reverse ()
    (interactive)
    (other-window -1))
#+end_src

#+begin_src emacs-lisp
  (provide 'cur-config-windows)
  ;;; cur-config-windows.el ends here
#+end_src

