home/programs/emacs/emacs.org
** IDE configurations (=cur-config-ide.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-ide.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-ide.el --- configuration to make emacs ide like

  ;;; Commentary:
  ;; The packages and configurations required to turn Emacs into an ide.
  ;; Primarily this means an lsp client, a completion system, a syntax
  ;; checker, and a dap client (yet to be included/configured).

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===LSP Mode===
  (use-package lsp-mode
    :demand t
    :hook
    (lsp-mode  . lsp-enable-which-key-integration)
    :custom
    (lsp-keymap-prefix "C-c C-M-l" "lsp mode keymap")
    :bind (:map lsp-mode-map
                ("C-c C-a" . lsp-execute-code-action)  ; code actions
                ("C-c C-e" . lsp-treemacs-errors-list) ; treemacs error list
                ("C-c f"   . lsp-find-references)      ; find references
                ("C-c r"   . lsp-find-definition))     ; find definitions
    :config
    (lsp-deferred)
    (setq gc-cons-threshold (* 100 1024 1024))
    (setq read-process-output-max (* 3 1024 1024))
    (setq lsp-idle-delay 0.500)
    (setq lsp-lens-enable nil)
    (lsp-enable-which-key-integration t))
#+end_src

#+begin_src emacs-lisp
  (use-package lsp-ui
    :after (lsp-mode)
    :custom
    (lsp-ui-doc-enable nil "lsp-ui doc disabled by default")
    (lsp-ui-doc-show-with-cursor t "lsp-ui doc follows cursor")
    (lsp-ui-doc-show-with-mouse t "lsp-ui doc follows mouse")
    (lsp-ui-doc-position 'at-point "lsp-ui doc shows at cursor")
    :bind (:map lsp-ui-mode-map
                ("C-c C-f" . lsp-ui-peek-find-references)  ; find references ui
                ("C-c C-r" . lsp-ui-peek-find-definitions) ; find definitions ui
                ("C-c C-d" . lsp-ui-doc-mode) ; toggle doc mode
                :map lsp-ui-peek-mode-map
                ("ESC" . lsp-ui-peek--abort)             ; toggle doc mode
                ("g"   . lsp-ui-peek--abort)             ; toggle doc mode
                ("j"   . lsp-ui-peek--select-next)       ; toggle doc mode
                ("k"   . lsp-ui-peek--select-prev)       ; toggle doc mode
                ("C-j" . lsp-ui-peek--select-next-file)  ; toggle doc mode
                ("C-k" . lsp-ui-peek--select-prev-file)) ; toggle doc mode
    :hook
    (lsp-mode . lsp-ui-mode))
#+end_src

#+begin_src emacs-lisp
  ;; ===Company Mode===
  (use-package company
    :hook
    (prog-mode . company-mode)
    (lsp-mode . company-mode)
    :bind (:map company-active-map
                ("<tab>" . company-complete-common-or-cycle)
                ("<return>" . company-complete-selection))
    (:map lsp-mode-map
          ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))
  ;;(company-tng-configure-default))
#+end_src

#+begin_src emacs-lisp
  ;; ===Flycheck===
  (use-package flycheck
    :hook
    (prog-mode . flycheck-mode)
    (lsp-mode  . flycheck-mode))
#+end_src

#+begin_src emacs-lisp
  ;; ===Treemacs==
  (use-package treemacs
    :bind
    (:map cur/sub-leader-keymap
          ("C-t" . treemacs-select-window))
    :config
    (treemacs-follow-mode))
#+end_src

#+begin_src emacs-lisp
  ;; ===xref-ivy===
  (use-package ivy-xref
    :after (ivy)
    :init
    (setq xref-show-definitions-function #'ivy-xref-show-defs)
    (setq xref-show-xrefs-function #'ivy-xref-show-xrefs))
#+end_src

#+begin_src emacs-lisp
  ;; ===Magit===
  (use-package magit
    :bind (:map cur/sub-leader-keymap
                ("C-M-g" . magit))
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
    (transient-default-level 5 "Allowing for commit signing"))
#+end_src

#+begin_src emacs-lisp
  ;; ===project.el===
  (use-package projectile
    :after (rg)
    :bind (:map cur/projectile-map
                ("C-p"   . projectile-switch-project)
                ("C-a"   . projectile-add-known-project)
                ("C-d"   . projectile-find-dir)
                ("d"     . projectile-dired)
                ("C-f"   . projectile-find-file)
                ("C-r"   . projectile-ripgrep)
                ("C-c"   . projectile-compile-project)
                ("C-b"   . projectile-switch-to-buffer)
                ("C-l"   . projectile-ibuffer)
                ("C-k"   . projectile-kill-buffers)
                ("C-v"   . projectile-vc)
                ("C-e"   . projectile-run-eshell))
    :config
    (projectile-mode 1))
#+end_src

#+begin_src emacs-lisp
  (use-package rg)
#+end_src

#+begin_src emacs-lisp
  (provide 'cur-config-ide)
  ;;; cur-config-ide.el ends here
#+end_src

** Configurations for Emacs Lisp (=cur-config-elisp.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-elisp.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-elisp.el --- configurations for working with elisp

  ;;; Commentary:

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===rainbow-delimiters===
  (use-package rainbow-delimiters
    ;:ensure t
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

#+begin_src emacs-lisp
  ;; ===Helpful Emacs-Lisp Functions===
  (defun cur/alist-add-or-replace (pair alist)
    "Function to add or replace a PAIR to ALIST and return ALIST.

  This does not set the variable to be a new value."
    (let* ((pair-key     (car pair))
           (alist-result (assoc pair-key alist)))
      (if alist-result
          (let ((new-alist (assoc-delete-all pair-key alist)))
            (push pair new-alist))
        (push pair alist))))

  (defun cur/alist-add-if-pair-not-exist (pair alist)
    "Function to add a PAIR to ALIST if PAIR is not in ALIST and return ALIST.

  This does not set the variable to be a new value."
    (let* ((pair-key     (car pair))
           (pair-value   (cdr pair))
           (alist-result (assoc pair-key alist)))
      (if (and alist-result (equal pair-value alist-result))
          nil
        (push pair alist))))

  (defun cur/alist-add-if-key-not-exist (pair alist)
    "Function to add a PAIR to ALIST if the key in PAIR is not in ALIST.
  Returns ALIST.

  This does not set the variable to be a new value."
    (let* ((pair-key     (car pair))
           (alist-result (assoc pair-key alist)))
      (if alist-result
          nil
        (push pair alist))))
#+end_src

#+begin_src emacs-lisp
  (provide 'cur-config-elisp)
  ;;; cur-config-elisp.el ends here
#+end_src

** Configurations for Java (=cur-config-java.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-java.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-java.el --- configuration for java

  ;;; Commentary:
  ;; My configuration for java in Emacs.
  ;; Currently does not work on my machine because jdtls
  ;; is not available in the void repos.  When it does I
  ;; will remove the comment in front of requiring this
  ;; package.

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===Java Tree-Sitter Mode===
  (use-package java-ts-mode
    :mode "\\.java\\'")

  ;; ===lsp-java===
  (use-package lsp-java
    :after (lsp-mode cc-mode)
    :init
    :hook
    (envrc-mode . (lambda ()
                    (when (equal major-mode 'java-ts-mode)
                      (setq lsp-java-server-install-dir (concat (getenv "JDTLS_PATH") "/share/java/jdtls/")))))
    (java-ts-mode . lsp-deferred)
    :config
    (defun lsp-java--ls-command ()
      (let ((jdtls-path (getenv "JDTLS_PATH"))
            (jdtls-exec-options (list
                                 "-configuration"
                                 (concat (getenv "HOME") "/.jdtls/config_linux")
                                 "-data"
                                 (concat (getenv "HOME") "/.jdtls/java-workspace"))))
        (message (concat jdtls-path "/share/java/"))
        (append (list (concat jdtls-path "/bin/jdtls")) jdtls-exec-options))))
#+end_src

#+begin_src emacs-lisp
  (provide 'cur-config-java)
  ;;; cur-config-java.el ends here
#+end_src

** Configurations for Mark-up Languages (=cur-config-markup.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-markup.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-markup.el --- configurations for comman markup languages
  ;;; Commentary:
  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===YAML===
  (use-package yaml-mode
    ;:ensure t
    :commands (yaml-mode))
#+end_src

#+begin_src emacs-lisp
  ;; ===EWW/Yuck Configuration===
  (use-package yuck-mode
    ;:ensure t
    :commands (yuck-mode))
#+end_src

#+begin_src emacs-lisp
  (provide 'cur-config-markup)
  ;;; cur-config-markup.el ends here
#+end_src

** Configurations for Nix (=cur-config-nix.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-nix.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-nix.el --- working with nix in emacs

  ;;; Commentary:

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===nix-mode===
  (use-package nix-mode
    :hook
    ((nix-mode) . lsp-deferred))
    ;:ensure t)
#+end_src

#+begin_src emacs-lisp
  (provide 'cur-config-nix)
  ;;; cur-config-nix.el ends here
#+end_src

** Configurations for Rust (=cur-config-rust.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-rust.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-rust.el --- rust language configurations

  ;;; Commentary:

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===Rust-Mode===
  (use-package rustic
    :after (lsp-mode)
    :hook (rustic . lsp-deferred))
#+end_src

#+begin_src emacs-lisp
  (provide 'cur-config-rust)
  ;;; cur-config-rust.el ends here
#+end_src

** Configurations for Haskell (=cur-config-haskell.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-haskell.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-haskell.el --- haskell language configurations

  ;;; Commentary:

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===Haskell-Mode===
  (use-package haskell-mode)

  ;; ===LSP-Haskell===
  (use-package lsp-haskell
    :hook
    ((haskell-mode) . lsp-deferred))

  ;; ===Company-GHCI===
  (use-package company-ghci
    :after (company)
    :custom (company-ghc-show-info t)
    :config
    (push 'company-ghci company-backends))
#+end_src

#+begin_src emacs-lisp
  (provide 'cur-config-haskell)
  ;;; cur-config-haskell.el ends here
#+end_src

** Configurations for C (=cur-config-c.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-c.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-c.el --- configuration for c

  ;;; Commentary:

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===C Tree-Sitter Mode===
  (use-package c-ts-mode
    :after (cc-mode)
    :mode
    ("\\.c\\'" . c-ts-mode)
    ("\\.h\\'" . c-ts-mode)
    :custom
    (c-default-style '((c-ts-mode . "linux")
                       (java-mode . "java")
                       (awk-mode  . "awk")
                       (other     . "gnu"))
     "default style for c programs is linux")
    :hook
    (c-ts-mode . (lambda () (require 'ccls) (lsp-deferred))))

  ;; ===CCLS Mode===
  (use-package ccls
    :after (cc-mode c-ts-mode))
#+end_src

#+begin_src emacs-lisp
  (provide 'cur-config-c)
  ;;; cur-config-c.el ends here
#+end_src

** Configurations for Zig (=cur-config-zig.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-zig.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-zig.el --- configuration for zig

  ;;; Commentary:

  ;;; Code:

  ;; ===Zig Mode===
  (use-package zig-mode)

  (provide 'cur-config-zig)
  ;;; cur-config-zig.el ends here
#+end_src

** Configurations for Go (=cur-config-go.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-go.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-go.el --- configuration for go

  ;;; Commentary:

  ;;; Code:
  
  ;; ===Go Tree-Sitter Mode===
  (use-package go-ts-mode
    :mode "\\.go\\'"
    :custom
    (go-ts-mode-indent-offset 4 "Set the indentation to 4")
    :hook (go-ts-mode . lsp-deferred))

  (provide 'cur-config-go)
  ;;; cur-config-java.el ends here
#+end_src

