home/programs/emacs/emacs.org
** Terminal emulation and Eshell configuration (=cur-config-shell.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-shell.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-shell.el --- accessing the shell in emacs

  ;;; Commentary:

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===Vterm===
  (use-package vterm
    :ensure nil
    :commands (vterm cur/meow-vterm-other-window cur/meow-vterm)
    :bind (:map vterm-mode-map
           ("C-c C-k" . cur/vterm-kill)
           :map cur/sub-leader-keymap
           ("C-RET" . cur/meow-vterm-other-window)
           ("RET"   . cur/meow-vterm))
    :init
    (defun cur/meow-vterm ()
      (interactive)
      (vterm)
      (meow-insert-mode))
    (defun cur/meow-vterm-other-window ()
      (interactive)
      (vterm-other-window)
      (meow-insert-mode))
    (defun cur/vterm-kill ()
      (interactive)
      (when (equal (buffer-name) "*vterm*")
        (let ((kill-buffer-query-functions nil))
          (kill-buffer-and-window))))
    :config
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")
    (setq vterm-max-scrollback 10000))
#+end_src

#+begin_src emacs-lisp
  ;; ===Eat===
  (use-package eat
    :config
    (eat-eshell-mode 1))
#+end_src

#+begin_src emacs-lisp
  ;; ===Eshell===
  (use-package eshell
    :init
    (defun cur/eshell-prompt ()
      (concat
       (propertize "[" 'face 'ansi-color-red)
       (propertize (eshell/whoami) 'face 'ansi-color-yellow)
       (propertize "@" 'face 'ansi-color-green)
       (propertize (system-name) 'face 'ansi-color-blue)
       " "
       (propertize (concat (eshell/pwd)) 'face 'ansi-color-magenta)
       (propertize "]" 'face 'ansi-color-red)
       (propertize "$ " 'face 'bold)))
    (defun eshell/ff (&optional file)
      "Eshell alias to open FILE. Will call `find-file' interactively if no file is
  specified."
      (cond (file
             (find-file file))
            (t
             (call-interactively 'find-file))))
    (defun eshell/dir (&optional dir)
      "Eshell alias to open `dired' at DIR. Will call `dired' on current directory
  if no directory is specified"
      (cond (dir
             (dired dir))
            (t
             (dired "."))))
    :custom
    (eshell-prompt-regexp "^\\[[^]]*\\]\\[?[[:digit:]]*\\]?[#$λ] " "Regex for custom eshell prompt")
    (eshell-prompt-function 'cur/eshell-prompt "Set custom prompt for eshell"))
#+end_src

#+begin_src emacs-lisp
  ;; ===Zoxide===
  (use-package zoxide)
#+end_src

#+begin_src emacs-lisp
  (provide 'cur-config-shell)
  ;;; cur-config-shell.el ends here
#+end_src

** Org-mode (=cur-config-org.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-config/cur-config-org.el
:END:

#+begin_src emacs-lisp
  ;;; cur-config-org.el --- configurations for org-mode

  ;;; Commentary:

  ;;; Code:
#+end_src

#+begin_src emacs-lisp
  ;; ===Org-Mode===
  (use-package org
    :ensure nil
    :defer t
    :hook (org-mode . cur/org-mode-setup)
    :bind (:map org-mode-map
            ("C-S-h" . outline-promote)
            ("C-S-j" . outline-move-subtree-down)
            ("C-S-k" . outline-move-subtree-up)
            ("C-S-l" . outline-demote))
    :init
    (defun cur/org-mode-setup ()
      (org-indent-mode 1)
      (variable-pitch-mode 0)
      (visual-line-mode 1)
      (flyspell-mode 1))
    (defun cur/org-font-setup ()
      ;; Replace list hyphen with dot
      (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•")))))))
    :custom
    (org-ellipsis " ▾" "Readable ellipsis")
    (org-agenda-start-with-log-mode t)
    (org-log-done 'time)
    (org-log-into-drawer t)
    (org-agenda-window-setup 'current-window "Have org-agenda pop up in the current window")
    :config
    (load-library "find-lisp")
    ;; (setq org-agenda-files (find-lisp-find-files "~/dox/agenda" "\.org$"))
    (setq org-agenda-time-grid '((daily today require-timed)
                                 (400 600 800 1000 1200 1400 1600 1800 2000 2200)
                                 "......" "----------------"))
    (setq org-format-latex-options '(:foreground "#e5e9e9" :scale 1.0))
    (cur/org-font-setup))
#+end_src

#+begin_src emacs-lisp
  ;; ===Org Bullets===
  (use-package org-bullets
    ;:ensure t
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("" "●" "○" "●" "○" "●" "○" "●" "○")))
  ;;  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
#+end_src

#+begin_src emacs-lisp
  ;; ===Org Tempo and SRC Blocks===
  (use-package org-tempo
    :after org
    :config
    (push '("conf-unix" . conf-unix) org-src-lang-modes)

    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))
    (add-to-list 'org-structure-template-alist '("tex" . "src latex"))
    (add-to-list 'org-structure-template-alist '("conf" . "src conf-unix"))
    (add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))
    (add-to-list 'org-structure-template-alist '("java" . "src java"))
    (add-to-list 'org-structure-template-alist '("elv" . "src elvish")))
#+end_src

#+begin_src emacs-lisp
  ;; ===Org Babel===
  (use-package ob
    :after org)
  ;; TODO: fix this so I can still auto tangle on saving
    ;; :init
    ;; (defun cur/org-babel-tangle-config ()
    ;;   (when (string-equal (file-name-directory (buffer-file-name))
    ;;                       (expand-file-name user-emacs-directory))
    ;;     ;; Dynamic scoping to the rescue
    ;;     (let ((org-confirm-babel-evaluate nil))
    ;;       (org-babel-tangle))))
    ;; 
    ;; (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'cur/org-babel-tangle-config))))

  (provide 'cur-config-org)
  ;;; cur-config-org.el ends here
#+end_src

* Custom Library Modules

** Custom modeline (=cur-modline.el=)
:PROPERTIES:
:header-args:emacs-lisp: :tangle ./cur-lisp/cur-modeline.el
:END:

#+begin_src emacs-lisp
  ;;; cur/modeline.el --- My custom modeline -*- lexical-binding: t -*-

  ;;; Commentary:
  ;;
  ;; This is my custom modeline.  This is here bascially because I don't want to
  ;; use doom modeline.

  ;;; Code:
  ;; (defgroup cur-modeline nil
  ;;   "My custom modeline that tries to be minimal."
  ;;   :group 'mode-line)
  ;; 
  ;; (defgroup cur-modeline-faces nil
  ;;   "The faces for my custom modeline."
  ;;   :group cur-modeline)

  (defun cur-mode-line/padding ()
    "Function to return padding so `mode-line-end-spaces' will be right aligned."
    (let ((r-length (length (format-mode-line mode-line-end-spaces))))
      (propertize " "
                  'display `(space :align-to (- right ,r-length)))))

  (setq-default mode-line-format
                '("%e"
                  (:eval
                   (when (and (mode-line-window-selected-p) defining-kbd-macro)
                     (propertize "  KMACRO  " 'face 'font-lock-string-face)))
                  (:eval
                   (when (and (mode-line-window-selected-p)
                              (buffer-narrowed-p)
                              (not (derived-mode-p 'Info-mode 'help-mode 'special-mode 'message-mode)))
                     (propertize "  NARROWED  " 'face 'font-lock-constant-face)))
                  (:eval
                   (when (and (member 'meow features) (mode-line-window-selected-p))
                     (propertize (format "  %s  " (upcase (symbol-name meow--current-state)))
                                 'face 'highlight)))
                  "  "
                  (:eval
                   (when (mode-line-window-selected-p)
                     (cond (buffer-read-only
                            (propertize "RO" 'face 'shadow))
                           ((buffer-modified-p)
                            (propertize "**" 'face 'shadow))
                           (t
                            (propertize "RW" 'face 'shadow)))))
                  "  "
                  (:eval
                   (propertize (format "%s" (buffer-name)) 'face 'bold))
                  "  "
                  (:eval
                   (if (mode-line-window-selected-p)
                     (propertize (capitalize (symbol-name major-mode)) 'face 'warning)
                     (propertize (capitalize (symbol-name major-mode)) 'face 'shadow)))
                  (:eval (cur-mode-line/padding))))

  (provide 'cur-modeline)
  ;;; cur-modeline.el ends here
#+end_src
